#include<stdio.h>
#include<string.h>
//单引号为字符，如'A'
//双引号为字符串,如"ABC"
//打印字符串用%s
//字符串的结束标志是'\0'的转义字符，在计算字符串长度时\0是结束标志，不算作字符串内容
int main()
{
	char a ='A';
	char arr1[] = "ABC";
	//"ABC"->其实是'A','B','C','\0',只不过\0的值为0。\0是字符串的结束标志
	char arr2[] = { 'A','B','C' };
	// { 'A','B','C' }里没有'\0',所有在ABC后面有随机值，直到取到\0
	printf("%c\n", a);
	printf("%s\n", arr1);
	printf("%s\n", arr2);
	printf("%d\n", strlen(arr1));	//strlen--string lenth计算字符串长度
	printf("%d\n", strlen(arr2));
	return 0;
}
/*
转义字符:
\?	--在书写连续多个问号时使用，防止他们被解析成三字母词
\'	--用于表示字符常量'
\"	--用于表示字符串内部的双引号
\\	--用于表示反斜杠，防止它被解析成一个转义序列符,即转换成普通\
\a	--警告字符，蜂鸣
\b	--退格符
\f	--进纸符
\n	--换行
\r	--回车
\t	--水平制表符
\v	--垂直制表符
\ddd	--ddd表示1~3个八进制数字，如\130 x
\xdd	--dd表示2个十六进制数字，如\x30 0
*/
